"use strict"

//Задача №2
//З клавіатури вводиться розмір заробітної плати та розмір прожиткового мінімуму. 
// Визначити розмір соціальної допомоги (ввжаємо, що заробітна плата є меншою).

//Задаємо значення

const subsistenceMin = parseInt(prompt('Введіть прожитковий мінімум', 3028))
const salary = parseInt(prompt('Введіть заробітню плату,\nякщо вона менша за прожитковий мінімум', 1950))

//Обчислюємо 

let socialAssistance = subsistenceMin - salary

// Виводимо результат

document.write(`Ваша соціальна допомога складає ${socialAssistance} грн.`)