"use strict"

//Задача №16
//упорядкувати тижні (рядки) за спаданням суми елементів у рядку (тобто при порівнянні двох рядків треба знайти суму кожного з рядків і порівнювати ці суми, на основі цих сум буде зрозуміло, який з елементів повинен іти раніше).

if (confirm('Start?')) {
	const profitTable = [
		// Понеділок, Вівторок, Середа, Четвер, П'ятниця, Субота, Неділя
		[1200, 1500, 1300, 1600, 1800, 2000, 1900], // Магазин 1
		[900, 1100, 1000, 1200, 1400, 1600, 1500],  // Магазин 2
		[1500, 1800, 1700, 1900, 2100, 2300, 2200], // Магазин 3
		[800, 950, 850, 1000, 1100, 1250, 1200]   // Магазин 4
	]
	for (const shop of profitTable) {
		shop.push(shop.reduce((prevSum, el) => prevSum + el))
	}
	profitTable.sort((row1, row2) => row2.at(-1) - row1.at(-1))
	profitTable.forEach((row) => row.pop())
	console.log(profitTable)
}